MESSAGES = {
    'city': {
        'question': 'Напишите название города (по-английски), '
                    'где будет проводиться поиск отеля:',
        'onerror': 'Ошибка поиска!. Попробуйте заново. \n'
                   'Напишите название города (по-английски), \n'
                   'где будет проводиться поиск отеля:',
        "onservererror": "Сайт недоступен. Попробуйте позже."
    },
    'count_hotels': {
        'question': 'Напишите количество отелей для поиска (не более 25):',
        'onerror': 'Ошибка ввода! Повторите. Вводятся только целые числа!\n'
                   'Количество отелей для поиска не больше 25'
    },
    'start_booking_year': {
        'question': 'Дата начала бронирования отеля\n'
                    'Напишите год (4-х значное число):',
        'onerror': 'Ошибка! Неверный год. Повторите ввод.\n'
                   'Напишите год (4-х значное число):'
    },
    'start_booking_month': {
        'question': 'Напишите месяц (1-12):',
        'onerror': 'Ошибка ввода! Повторите ввод.'
    },
    'start_booking_day': {
        'question': 'Напишите день (1-31):',
        'onerror': 'Ошибка ввода! Повторите. Только целые числа!\n'
                   'Напишите день (1-31):'
    },
    'end_booking_year': {
        'question': 'Дата начала бронирования отеля\n'
                    'Напишите год (4-х значное число):',
        'onerror': 'Ошибка! Неверный год. Повторите ввод.\n'
                   'Напишите год (4-х значное число):'
    },
    'end_booking_month': {
        'question': 'Напишите месяц (1-12):',
        'onerror': 'Ошибка ввода! Повторите ввод.'
    },
    'end_booking_day': {
        'question': 'Напишите день (1-31):',
        'onerror': 'Ошибка ввода! Повторите. Только целые числа!\n'
                   'Напишите день (1-31):'
    },
    'amount_people': {
        'question': 'Напишите количество человек, заселяющихся в отель:',
        'onerror': 'Ошибка ввода! Повторите. Только целые числа меньше 50!\n'
                   'Напишите количество человек, заселяющихся в отель:'
    },
    'price_range': {
        'question': 'Укажите в долларах диапазон цен за ночь в отеле, напишите через тире (0-10000): ',
        'onerror': 'Ошибка.Неправильный диапазон.'
                   'Укажите в долларах диапазон цен за ночь в отеле, напишите через тире (0-10000):'
    },
    'dist_range': {
        'question': 'Укажите диапазон расстояния (в милях), на котором '
                    'находится отель от центра, через тире (0 - 500)',
        'onerror': 'Ошибка.Неправильный диапазон.Укажите диапазон расстояния (в милях), '
                   'на котором находится отель от центра, напишите через тире (0 - 500) '
    },
    'show_photos': {
        'question': 'Показать фотографии каждого из отелей? Напишите "Да" или "Нет"',
        'onerror': 'Непонятный ввод. Повторите.\n'
                   'Показать ли фотографии каждого из отелей? Напишите "Да" или "Нет"'
    },
    'count_photos': {
        'question': 'По сколько фотографий отелей выводить?'
                    ' (максимум по 15), напишите целое число: ',
        'onerror': 'Ошибка ввода! Повторите. Только целые числа меньше 15!'
    },
    'final': {
        'question': 'Подождите, идет поиск...',
        'onerror': 'Отелей найдено не так много, сколько требовалось'
    }
}
